app/Controllers/Dashboard.php

SELECT *
FROM `students`
WHERE `enrollment_status` = 'Pending'
SELECT *
FROM `students`
WHERE `enrollment_status` = 'Enrolled'
SELECT *
FROM `students`
WHERE `enrollment_status` = 'Dropped'
---
    public function index()
    {
        // Redirect to login if not authenticated
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Get students by enrollment status
        $data = [
            'pending'  => $this->studentModel->where('enrollment_status', 'Pending')->findAll(),
            'enrolled' => $this->studentModel->where('enrollment_status', 'Enrolled')->findAll(),
            'dropped'  => $this->studentModel->where('enrollment_status', 'Dropped')->findAll(),
        ];