app/Controllers/Enrollment.php

    public function index()
    {
        // Get all students with enrollment status
        $data['students'] = $this->studentModel->findAll();
---
SELECT *
FROM `students`

    public function updateStatus($id = null)
    {
        if (!$id) {
            return redirect()->to('/enrollment')->with('error', 'Invalid student ID.');
        }

        $status = $this->request->getPost('status');

        // Validate status
        if (!in_array($status, ['Pending', 'Enrolled', 'Dropped'])) {
            return redirect()->to('/enrollment')->with('error', 'Invalid status.');
        }

        $student = $this->studentModel->find($id);

        if (!$student) {
            return redirect()->to('/enrollment')->with('error', 'Student not found.');
        }

        $this->studentModel->update($id, ['enrollment_status' => $status]);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '1'
UPDATE `students` SET `enrollment_status` = 'Dropped', `updated_at` = '2025-05-25 15:12:21'
WHERE `students`.`id` IN ('1')