app/Controllers/Report.php

    public function index()
    {
        $model = new StudentModel();

        // Count of students by status
        $enrolledCount = $model->where('enrollment_status', 'Enrolled')->countAllResults();

        // Reset the builder before reusing
        $model->resetQuery();
        $pendingCount = $model->where('enrollment_status', 'Pending')->countAllResults();

        $model->resetQuery();
        $droppedCount = $model->where('enrollment_status', 'Dropped')->countAllResults();

        // Get only enrolled students for group counts
        $model->resetQuery();
        $enrolledStudents = $model->where('enrollment_status', 'Enrolled')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `enrollment_status` = 'Enrolled'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `enrollment_status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `enrollment_status` = 'Dropped'
SELECT *
FROM `students`
WHERE `enrollment_status` = 'Enrolled'