app/Controllers/Student.php

SELECT *
FROM `students`
WHERE `enrollment_status` = 'enrolled'
---
    public function index()
    {
        // Fetch students where enrollment_status = 'enrolled'
        $data['students'] = $this->studentModel->where('enrollment_status', 'enrolled')->findAll();